import {ratingDescription} from "~/utils/types";

export const rating: Array<ratingDescription> = [
  {
    id: 1,
    year: 2021,
    keys: [
      {title: "Рэнкинг крупнейших оценочных организаций", value: "9"},
      {title: "Рэнкинг делового потенциала оценочных организаций", value: "15"},
      {title: "Оценка бизнеса и ценных бумаг", value: "9"},
      {title: "Переоценка основных средств / оценка в целях МСФО", value: "1"},
      {title: "Оценка нематериальных активов и интеллектуальной собственности", value: "1"},
      {title: "Оценка инвестиционных проектов", value: "4"},
      {
        title: "Рэнкинги оценочных организаций по региональной(окружной) принадлежности: Центральный федеральный округ",
        value: "9"
      },
    ]
  },
  {
    id: 2,
    year: 2020,
    keys: [
      {title: "Рэнкинг крупнейших оценочных организаций", value: "9"},
      {title: "Рэнкинг делового потенциала оценочных организаций", value: "11"},
      {title: "Оценка бизнеса и ценных бумаг", value: "18"},
      {title: "Переоценка основных средств / оценка в целях МСФО", value: "1"},
      {title: "Оценка нематериальных активов и интеллектуальной собственности", value: "2"},
      {
        title: "Рэнкинги оценочных организаций по региональной(окружной) принадлежности: Центральный федеральный округ",
        value: "9"
      },
    ]
  },
  {
    id: 3,
    year: 2019,
    keys: [
      {title: "Рэнкинг крупнейших оценочных организаций", value: "14"},
      {title: "Рэнкинг делового потенциала оценочных организаций", value: "15"},
      {title: "Оценка бизнеса и ценных бумаг", value: "99"},
      {title: "Переоценка основных средств / оценка в целях МСФО", value: "1"},
      {title: "Оценка нематериальных активов и интеллектуальной собственности", value: "7"},
      {
        title: "Рэнкинги оценочных организаций по региональной(окружной) принадлежности: Центральный федеральный округ",
        value: "12"
      },
    ]
  },
  {
    id: 4,
    year: 2018,
    keys: [
      {title: "Рэнкинг крупнейших оценочных организаций", value: "8"},
      {title: "Рэнкинг делового потенциала оценочных организаций", value: "13"},
      {title: "Переоценка основных средств / оценка в целях МСФО", value: "1"},
      {title: "Оценка нематериальных активов и интеллектуальной собственности", value: "6"},
    ]
  },
  {
    id: 5,
    year: 2017,
    keys: [
      {title: "Рэнкинг крупнейших оценочных организаций", value: "11"},
      {title: "Рэнкинг делового потенциала оценочных организаций", value: "21"},
      {title: "Переоценка основных средств / оценка в целях МСФО", value: "2"},
      {title: "Оценка нематериальных активов и интеллектуальной собственности", value: "3"},
    ]
  },
  {
    id: 6,
    year: 2016,
    keys: [
      {title: "Рэнкинг крупнейших оценочных организаций", value: "13"},
      {title: "Рэнкинг делового потенциала оценочных организаций", value: "26"},
      {title: "Переоценка основных средств / оценка в целях МСФО", value: "1"},
      {title: "Оценка нематериальных активов и интеллектуальной собственности", value: "24"},
    ]
  },
  {
    id: 7,
    year: 2015,
    keys: [
      {title: "Рэнкинг крупнейших оценочных организаций", value: "24"},
      {title: "Рэнкинг делового потенциала оценочных организаций", value: "43"},
      {title: "Переоценка основных средств / оценка в целях МСФО", value: "2"},
      {title: "Оценка нематериальных активов и интеллектуальной собственности", value: "25"},
    ]
  },
  {
    id: 8,
    year: 2014,
    keys: [
      {title: "Рэнкинг крупнейших оценочных организаций", value: "21"},
      {title: "Рэнкинг делового потенциала оценочных организаций", value: "59"},
      {title: "Переоценка основных средств / оценка в целях МСФО", value: "2"},
      {title: "Оценка нематериальных активов и интеллектуальной собственности", value: "14"},
    ]
  },
  {
    id: 9,
    year: 2013,
    keys: [
      {title: "Рэнкинг крупнейших оценочных организаций", value: "41"},
      {title: "Рэнкинг делового потенциала оценочных организаций", value: "59"},
      {title: "Переоценка основных средств / оценка в целях МСФО", value: "7"},
    ]
  },
  {
    id: 10,
    year: 2012,
    keys: [
      {title: "Рэнкинг крупнейших оценочных организаций", value: "44"},
      {title: "Рэнкинг делового потенциала оценочных организаций", value: "66"},
      {title: "Переоценка основных средств / оценка в целях МСФО", value: "10"},
    ]
  },
  {
    id: 11,
    year: 2011,
    keys: [
      {title: "Рэнкинг крупнейших оценочных организаций", value: "59"},
      {title: "Рэнкинг делового потенциала оценочных организаций", value: "76"},
    ]
  },
]

