import {ratingButton, ratingDescription} from "~/utils/types";

export const ratingButtons: Array<ratingButton> = [
  {id: 1, title: "2021", year: 2021},
  {id: 2, title: "2020", year: 2020},
  {id: 3, title: "2019", year: 2019},
  {id: 4, title: "2018", year: 2018},
  {id: 5, title: "2017", year: 2017},
  {id: 6, title: "2016", year: 2016},
  {id: 7, title: "2015", year: 2015},
  {id: 8, title: "2014", year: 2014},
  {id: 9, title: "2013", year: 2013},
  {id: 10, title: "2012", year: 2012}
];

export const ratingDescriptions: Array<ratingDescription> = [
  {
    id: 1,
    year: 2021,
    keys: [
      {title: "Рэнкинг крупнейших оценочных организаций:", value: "9"},
      {title: "Рэнкинг делового потенциала оценочных организаций:", value: "15"},
      {title: "Оценка бизнеса и ценных бумаг:", value: "9"},
      {title: "Переоценка основных средств / оценка в целях МСФО:", value: ""},
      {title: "Оценка нематериальных активов и интеллектуальной собственности:", value: ""},
      {title: "Оценка инвестиционных проектов:", value: ""},
      {
        title: "Рэнкинги оценочных организаций по региональной(окружной) принадлежности: Центральный федеральный округ:",
        value: ""
      },
    ]
  },
  {
    id: 2,
    year: 2020,
    keys: [
      {title: "Рэнкинг крупнейших оценочных организаций:", value: ""},
      {title: "Рэнкинг делового потенциала оценочных организаций:", value: ""},
      {title: "Оценка бизнеса и ценных бумаг:", value: ""},
      {title: "Переоценка основных средств / оценка в целях МСФО:", value: ""},
      {title: "Оценка нематериальных активов и интеллектуальной собственности:", value: ""},
      {title: "Оценка инвестиционных проектов:", value: ""},
      {
        title: "Рэнкинги оценочных организаций по региональной(окружной) принадлежности: Центральный федеральный округ:",
        value: ""
      },
    ]
  },
  {
    id: 3,
    year: 2019,
    keys: [
      {title: "Рэнкинг крупнейших оценочных организаций:", value: ""},
      {title: "Рэнкинг делового потенциала оценочных организаций:", value: ""},
      {title: "Оценка бизнеса и ценных бумаг:", value: ""},
      {title: "Переоценка основных средств / оценка в целях МСФО:", value: ""},
      {title: "Оценка нематериальных активов и интеллектуальной собственности:", value: ""},
      {title: "Оценка инвестиционных проектов:", value: ""},
      {
        title: "Рэнкинги оценочных организаций по региональной(окружной) принадлежности: Центральный федеральный округ:",
        value: ""
      },
    ]
  },
  {
    id: 4,
    year: 2018,
    keys: [
      {title: "Рэнкинг крупнейших оценочных организаций:", value: ""},
      {title: "Рэнкинг делового потенциала оценочных организаций:", value: ""},
      {title: "Оценка бизнеса и ценных бумаг:", value: ""},
      {title: "Переоценка основных средств / оценка в целях МСФО:", value: ""},
      {title: "Оценка нематериальных активов и интеллектуальной собственности:", value: ""},
      {title: "Оценка инвестиционных проектов:", value: ""},
      {
        title: "Рэнкинги оценочных организаций по региональной(окружной) принадлежности: Центральный федеральный округ:",
        value: ""
      },
    ]
  },
  {
    id: 5,
    year: 2017,
    keys: [
      {title: "Рэнкинг крупнейших оценочных организаций:", value: ""},
      {title: "Рэнкинг делового потенциала оценочных организаций:", value: ""},
      {title: "Оценка бизнеса и ценных бумаг:", value: ""},
      {title: "Переоценка основных средств / оценка в целях МСФО:", value: ""},
      {title: "Оценка нематериальных активов и интеллектуальной собственности:", value: ""},
      {title: "Оценка инвестиционных проектов:", value: ""},
      {
        title: "Рэнкинги оценочных организаций по региональной(окружной) принадлежности: Центральный федеральный округ:",
        value: ""
      },
    ]
  },
  {
    id: 6,
    year: 2016,
    keys: [
      {title: "Рэнкинг крупнейших оценочных организаций:", value: ""},
      {title: "Рэнкинг делового потенциала оценочных организаций:", value: ""},
      {title: "Оценка бизнеса и ценных бумаг:", value: ""},
      {title: "Переоценка основных средств / оценка в целях МСФО:", value: ""},
      {title: "Оценка нематериальных активов и интеллектуальной собственности:", value: ""},
      {title: "Оценка инвестиционных проектов:", value: ""},
      {
        title: "Рэнкинги оценочных организаций по региональной(окружной) принадлежности: Центральный федеральный округ:",
        value: ""
      },
    ]
  },
  {
    id: 7,
    year: 2015,
    keys: [
      {title: "Рэнкинг крупнейших оценочных организаций:", value: ""},
      {title: "Рэнкинг делового потенциала оценочных организаций:", value: ""},
      {title: "Оценка бизнеса и ценных бумаг:", value: ""},
      {title: "Переоценка основных средств / оценка в целях МСФО:", value: ""},
      {title: "Оценка нематериальных активов и интеллектуальной собственности:", value: ""},
      {title: "Оценка инвестиционных проектов:", value: ""},
      {
        title: "Рэнкинги оценочных организаций по региональной(окружной) принадлежности: Центральный федеральный округ:",
        value: ""
      },
    ]
  },
  {
    id: 8,
    year: 2014,
    keys: [
      {title: "Рэнкинг крупнейших оценочных организаций:", value: ""},
      {title: "Рэнкинг делового потенциала оценочных организаций:", value: ""},
      {title: "Оценка бизнеса и ценных бумаг:", value: ""},
      {title: "Переоценка основных средств / оценка в целях МСФО:", value: ""},
      {title: "Оценка нематериальных активов и интеллектуальной собственности:", value: ""},
      {title: "Оценка инвестиционных проектов:", value: ""},
      {
        title: "Рэнкинги оценочных организаций по региональной(окружной) принадлежности: Центральный федеральный округ:",
        value: ""
      },
    ]
  },
  {
    id: 8,
    year: 2013,
    keys: [
      {title: "Рэнкинг крупнейших оценочных организаций:", value: ""},
      {title: "Рэнкинг делового потенциала оценочных организаций:", value: ""},
      {title: "Оценка бизнеса и ценных бумаг:", value: ""},
      {title: "Переоценка основных средств / оценка в целях МСФО:", value: ""},
      {title: "Оценка нематериальных активов и интеллектуальной собственности:", value: ""},
      {title: "Оценка инвестиционных проектов:", value: ""},
      {
        title: "Рэнкинги оценочных организаций по региональной(окружной) принадлежности: Центральный федеральный округ:",
        value: ""
      },
    ]
  },
  {
    id: 8,
    year: 2012,
    keys: [
      {title: "Рэнкинг крупнейших оценочных организаций:", value: ""},
      {title: "Рэнкинг делового потенциала оценочных организаций:", value: ""},
      {title: "Оценка бизнеса и ценных бумаг:", value: ""},
      {title: "Переоценка основных средств / оценка в целях МСФО:", value: ""},
      {title: "Оценка нематериальных активов и интеллектуальной собственности:", value: ""},
      {title: "Оценка инвестиционных проектов:", value: ""},
      {
        title: "Рэнкинги оценочных организаций по региональной(окружной) принадлежности: Центральный федеральный округ:",
        value: ""
      },
    ]
  },
]

